In [1]:
import pandas as pd

In [2]:
df = pd.read_json("../data/output.json")
df.head()

,url,text,model,year,engine,noskr,price
0,/msg/lv/transport/cars/audi/a6/bdbkme.html,"Pārdošanā Audi A6 Avant, 2015. gada / 3.0D / 1...",A6,2015,3.0D,-,"17,500 €"
1,/msg/lv/transport/cars/audi/s4/ajllb.html,"Pārdod Audi S4, ar 4.2 Benzīna motoru un autom...",S4,2005,4.2,209 tūkst.,"7,300 €"
2,/msg/lv/transport/cars/audi/a4/gjegb.html,Audi A4 2.0Tdi universāls. \r\nTehniski un viz...,A4,2005,2.0D,-,"3,200 €"
3,/msg/lv/transport/cars/audi/a6/flegp.html,Numurs davana. Lizing bez pirmo iemaksa. Gaz+b...,A6,1997,2.4,-,700 €
4,/msg/lv/transport/cars/audi/a2/fhnmn.html,"No Vacijas, izcila tehniska un vizuala stavokl...",A2,2003,1.4D,-,"2,950 €"

In [3]:
df.shape

(28, 7)

In [4]:
df.describe()

              year
count    28.000000
mean   2004.392857
std       6.032869
min    1994.000000
25%    1999.750000
50%    2005.000000
75%    2007.000000
max    2016.000000